{
  "backend/main.mo": "Defines backend actor with data types for users, content, media, notifications, settings, activity logs, and live polls, along with in‑memory maps and authorization/storage mixins.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to related frontend files, components, and test IDs for traceability.",
  "frontend-file-summaries.txt": "Provides prewritten short summaries of many frontend source files for reference or documentation.",
  "frontend/index.css": "Tailwind base theme file defining OKLCH color tokens, dark mode variables, and global background/foreground styles.",
  "frontend/index.html": "Basic HTML entry file mounting the React app and loading main.tsx.",
  "frontend/README.md": "Frontend README explaining project features, development setup, authentication flow, admin access, and live poll management.",
  "frontend/src/App.tsx": "Main React app component handling hash-based routing, non-blocking decommission status checks, and top-level error boundary.",
  "frontend/src/assets/generatedAssets.ts": "Exports constants for generated static asset paths such as logo and background images.",
  "frontend/src/components/admin/AccessDeniedView.tsx": "UI card shown to non-admin users explaining lack of admin permissions with a button to return home.",
  "frontend/src/components/admin/AdminAuthErrorView.tsx": "Displays admin authentication error details with retry and home-navigation actions.",
  "frontend/src/components/admin/AdminModuleRouter.tsx": "Selects and renders the appropriate admin module view based on the activeModule prop.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Guards admin routes by checking identity and admin status, showing loading, errors, or access-denied states as needed.",
  "frontend/src/components/admin/common/AdminDataTable.tsx": "Generic searchable data table component that renders columns dynamically and displays empty-state messaging.",
  "frontend/src/components/admin/common/DeleteConfirmDialog.tsx": "Reusable confirmation dialog for delete actions with loading support.",
  "frontend/src/components/admin/common/FormErrorText.tsx": "Displays a small validation error message with an icon.",
  "frontend/src/components/admin/jobs/JobForm.tsx": "Form for creating or editing a job posting with validation and backend mutation handling.",
  "frontend/src/components/admin/jobs/JobsList.tsx": "Lists all jobs with search, edit, and delete actions, using a data table and confirmation dialog.",
  "frontend/src/components/admin/media/MediaList.tsx": "Displays media files with search, filtering, preview, and delete capabilities.",
  "frontend/src/components/admin/media/MediaPreviewDialog.tsx": "Modal dialog to preview images or PDFs and download media files.",
  "frontend/src/components/admin/media/MediaUploadCard.tsx": "Component for selecting, validating, and uploading media files with progress tracking and error handling.",
  "frontend/src/components/admin/modules/BackupSecurityModuleView.tsx": "Displays backup download tools and tabs for viewing activity logs and login history.",
  "frontend/src/components/admin/modules/DashboardOverviewView.tsx": "Shows dashboard metrics, recent activity, and a refreshable overview of system statistics.",
  "frontend/src/components/admin/modules/JobsModuleView.tsx": "Provides job listing management with dialogs for creating and editing jobs.",
  "frontend/src/components/admin/modules/MediaLibraryModuleView.tsx": "Renders media upload tools and a list of uploaded media items.",
  "frontend/src/components/admin/modules/NewsModuleView.tsx": "Manages creation and editing of news articles with a list and form dialog.",
  "frontend/src/components/admin/modules/NotificationsModuleView.tsx": "Offers notification composition and history viewing through tabbed navigation.",
  "frontend/src/components/admin/modules/ReportsAnalyticsModuleView.tsx": "Displays the reports and analytics dashboard for viewing statistics.",
  "frontend/src/components/admin/modules/SchemesModuleView.tsx": "Provides listing and form dialogs for creating and editing government schemes.",
  "frontend/src/components/admin/modules/UsersModuleView.tsx": "Manages user accounts with creation, editing, and detailed viewing support.",
  "frontend/src/components/admin/modules/VotingResultsModuleView.tsx": "Allows viewing and editing voting results with a form dialog for new entries.",
  "frontend/src/components/admin/modules/WebsiteSettingsModuleView.tsx": "Displays website settings form with logo picker and loading skeletons.",
  "frontend/src/components/admin/news/FeaturedImagePickerDialog.tsx": "Dialog for searching, filtering, and selecting a featured image from media items.",
  "frontend/src/components/admin/news/NewsForm.tsx": "News creation and editing form handling validation, image selection, and submit mutations.",
  "frontend/src/components/admin/news/NewsList.tsx": "Displays searchable news list with edit, publish, and delete actions using admin mutations.",
  "frontend/src/components/admin/notifications/NotificationComposer.tsx": "Form to compose and send notifications to all users or selected users with validation.",
  "frontend/src/components/admin/notifications/NotificationsHistoryList.tsx": "Shows a list of past notifications with delivery status and timestamps.",
  "frontend/src/components/admin/reports/ReportsDashboard.tsx": "Dashboard showing user/news stats and provides CSV export for users and news.",
  "frontend/src/components/admin/schemes/DocumentsPickerDialog.tsx": "Dialog for filtering, selecting, and returning PDF/document media items from the media library.",
  "frontend/src/components/admin/schemes/SchemeForm.tsx": "Form component for creating or updating schemes with validation, document selection, and mutation handling.",
  "frontend/src/components/admin/schemes/SchemesList.tsx": "Lists all schemes with search, edit, and delete actions using a data table and confirmation dialog.",
  "frontend/src/components/admin/security/ActivityLogTable.tsx": "Displays all admin activity logs in a table with timestamps, principals, and activity details.",
  "frontend/src/components/admin/security/BackupDownloadCard.tsx": "Provides a button to export and download a full system backup with loading state.",
  "frontend/src/components/admin/security/LoginHistoryTable.tsx": "Shows login and logout events filtered from admin activities in a tabular format.",
  "frontend/src/components/admin/settings/LogoPickerDialog.tsx": "Dialog for selecting and saving a website logo from uploaded image media.",
  "frontend/src/components/admin/settings/WebsiteSettingsForm.tsx": "Form for editing website settings including name, contact info, SEO fields, and logo selector trigger.",
  "frontend/src/components/admin/users/UserDetailsDrawer.tsx": "Drawer displaying detailed user info with role assignment and edit action.",
  "frontend/src/components/admin/users/UserFormDialog.tsx": "Modal form for creating or editing a user with validation and submission via user mutations.",
  "frontend/src/components/admin/users/UsersList.tsx": "Displays all users in a searchable table with actions for viewing, editing, toggling status, and deleting.",
  "frontend/src/components/admin/voting-results/VotingResultFormDialog.tsx": "Dialog form for adding or editing voting results with validation and create/update mutations.",
  "frontend/src/components/admin/voting-results/VotingResultsList.tsx": "Lists voting results with search, deletion, and metadata display including timestamps and total count.",
  "frontend/src/components/app/AppErrorBoundary.tsx": "Global React error boundary that shows a fallback UI with reload option and error details.",
  "frontend/src/components/auth/LoginFooter.tsx": "Footer showing About, Privacy Policy, and Contact buttons plus a copyright line.",
  "frontend/src/components/auth/MemberLoginCard.tsx": "Login card allowing members to enter mobile or password and request OTP, navigating to the dashboard on submit.",
  "frontend/src/components/dashboard/DashboardLayout.tsx": "Main dashboard layout handling navbar, sidebar, mobile toggle, and content switching between user and admin modes.",
  "frontend/src/components/dashboard/DashboardMainContent.tsx": "Renders the main dashboard widgets including welcome section, profile progress, quick stats, and recent activities.",
  "frontend/src/components/dashboard/DashboardNavbar.tsx": "Top navigation bar providing search, notifications, user menu, and logout handling with identity and role data.",
  "frontend/src/components/dashboard/DashboardRightPanel.tsx": "Right-side panel showing quick links and a list of recent announcements with priority badges.",
  "frontend/src/components/dashboard/DashboardSidebar.tsx": "Collapsible sidebar displaying user or admin navigation items and handling active selection and mobile overlay behavior.",
  "frontend/src/components/notifications/NotificationLauncherButton.tsx": "Notification button with unread badge count that triggers opening the notification panel.",
  "frontend/src/components/notifications/NotificationPanel.tsx": "Slide-in notification panel that lists user notifications, supports marking items read, and handles keyboard/overlay closing.",
  "frontend/src/components/notifications/NotificationPanelErrorBoundary.tsx": "Error boundary that shows a small fallback message if the notification panel fails to render.",
  "frontend/src/components/site/BrandLogo.tsx": "Displays a logo image with size variants and a styled fallback if loading fails.",
  "frontend/src/components/site/ComingSoonRibbon.tsx": "Shows a ribbon announcing upcoming Gram Pradhan voting results with styled card and badge.",
  "frontend/src/components/site/LivePollAdminPanel.tsx": "Provides admin controls to create, update, or reset a live poll with candidate management and duration settings.",
  "frontend/src/components/site/LivePollResultsChart.tsx": "Renders a responsive bar chart of poll results with memoized colors and custom tooltip styling.",
  "frontend/src/components/site/LivePollWidget.tsx": "Displays poll status, voting interface, countdown timer, results chart, and admin panel for live polls.",
  "frontend/src/components/site/LiveVotingResultsWidget.tsx": "Fetches and displays live village voting results in a table with loading and error states.",
  "frontend/src/components/site/SiteFooter.tsx": "Shows a footer with branding, support email, copyright, and promotional link.",
  "frontend/src/components/site/SiteLayout.tsx": "Wraps page content with a main container and footer layout structure.",
  "frontend/src/components/site/TextLogo.tsx": "Displays a stylized text logo with size and color variants.",
  "frontend/src/components/site/VotingPromoSection.tsx": "Combines live poll and voting results sections inside a styled promotional layout.",
  "frontend/src/hooks/admin/dashboard.ts": "Provides React Query hooks to fetch dashboard metrics, recent activity, and monthly growth from the backend actor.",
  "frontend/src/hooks/admin/jobs.ts": "Provides React Query hooks to fetch and manage jobs including create, update, and delete operations with automatic cache invalidation.",
  "frontend/src/hooks/admin/media.ts": "Implements hooks to fetch media and upload or delete media files, supporting upload progress and cache refresh.",
  "frontend/src/hooks/admin/news.ts": "Contains hooks for retrieving, creating, updating, publishing, and deleting news items with React Query.",
  "frontend/src/hooks/admin/notifications.ts": "Adds hooks for sending notifications to users and fetching the notifications history.",
  "frontend/src/hooks/admin/schemes.ts": "Defines hooks to get, create, update, and delete government schemes via actor calls.",
  "frontend/src/hooks/admin/security.ts": "Provides hooks to fetch admin activity logs and export system backups as downloadable JSON.",
  "frontend/src/hooks/admin/settings.ts": "Contains hooks to load and update website settings using a fixed settings ID.",
  "frontend/src/hooks/admin/useAdminAuth.ts": "Handles retrieval of the caller’s user role and admin status with caching and retry logic.",
  "frontend/src/hooks/admin/users.ts": "Implements hooks to list, retrieve, create, update, delete, and manage roles/status of users.",
  "frontend/src/hooks/admin/votingResults.ts": "Provides hooks to manage voting results including fetch, create, update, and delete operations.",
  "frontend/src/hooks/livePoll.ts": "Defines hooks for live poll status, results, voting, poll management, and periodic polling.",
  "frontend/src/hooks/notifications.ts": "Supplies hooks to get user-specific notifications and mark them as read.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current Internet Identity, recreating it on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useExampleNotifications.ts": "Empty placeholder hook file for future notification features.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including login, logout, and identity restoration.",
  "frontend/src/hooks/useQueries.ts": "Placeholder for future React Query hooks with no current implementation.",
  "frontend/src/hooks/useSystemStatus.ts": "Queries backend availability by calling a lightweight method and infers whether the system is decommissioned.",
  "frontend/src/hooks/votingResults.ts": "Fetches all voting results from the backend with periodic polling.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom theme variables for colors, layout, and UI components.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Renders the admin dashboard within a route guard using the main dashboard layout.",
  "frontend/src/pages/AdminLoginPage.tsx": "Provides an Internet Identity login flow for admins and navigates to the admin dashboard on success.",
  "frontend/src/pages/DecommissionedPage.tsx": "Static page informing users that the website and its services are permanently decommissioned.",
  "frontend/src/pages/HomePage.tsx": "Displays the main landing page with hero content, navigation buttons, notifications, and promotional sections.",
  "frontend/src/pages/MemberLoginPage.tsx": "Shows the member login screen with branding, background imagery, and a login card component.",
  "frontend/src/pages/UserDashboardPage.tsx": "Renders the user dashboard using the shared dashboard layout in non-admin mode.",
  "frontend/src/utils/adminAuthError.ts": "Normalizes backend admin authorization errors into user-friendly messages and detects authorization errors.",
  "frontend/src/utils/hashRouting.ts": "Provides hash-based page routing utilities to parse, convert, and update URL hashes for navigation.",
  "frontend/src/utils/pollErrors.ts": "Maps common poll-related backend errors to readable UI messages and identifies authentication-related poll errors.",
  "frontend/src/utils/time.ts": "Converts between nanoseconds and milliseconds and calculates formatted or structured time remaining until a given timestamp.",
  "frontend/src/utils/urlParams.ts": "Handles URL and session-based parameter retrieval, persistence, and cleanup for routing and state management.",
  "frontend/src/utils/userRole.ts": "Checks whether a user role is admin and converts role enums into readable labels.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, typography, animations, and utility presets.",
  "project_state.json": "Project state metadata describing features, issues, and requirements for the Smart Janghai project."
}