{
  "backend/main.mo": "Defines core data types, maps, and activity logging for users, news, schemes, jobs, media, notifications, and settings with access control and storage mixins.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten short descriptions summarizing many frontend files and their roles in the app.",
  "frontend/index.css": "Global Tailwind-based OKLCH theme variables and dark mode definitions applied across the app.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main client-side router using internal state to switch between home, login, dashboard, and admin pages.",
  "frontend/src/assets/generatedAssets.ts": "Exports static asset paths for logo and background images.",
  "frontend/src/components/admin/AccessDeniedView.tsx": "Displays an access-denied message for non-admin users with a button to return home.",
  "frontend/src/components/admin/AdminAuthErrorView.tsx": "Renders an admin-auth failure screen with error details, retry, and home navigation actions.",
  "frontend/src/components/admin/AdminModuleRouter.tsx": "Routes the admin dashboard to the correct module view based on the active module key.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Protects admin routes by checking identity and role, showing loading, error, or access-denied states as needed.",
  "frontend/src/components/admin/common/AdminDataTable.tsx": "Generic searchable table component showing rows via column accessors with empty-state handling.",
  "frontend/src/components/admin/common/DeleteConfirmDialog.tsx": "Reusable confirmation dialog for destructive actions with loading state.",
  "frontend/src/components/admin/common/FormErrorText.tsx": "Small component displaying a validation error message with an icon.",
  "frontend/src/components/admin/jobs/JobForm.tsx": "Form for creating or updating jobs with validation, mutation handling, and BigInt timestamp conversion.",
  "frontend/src/components/admin/jobs/JobsList.tsx": "Displays all jobs with search, edit, and delete actions using a data table and confirmation dialog.",
  "frontend/src/components/admin/media/MediaList.tsx": "Lists media files with search, previews, delete actions, and loading skeletons.",
  "frontend/src/components/admin/media/MediaPreviewDialog.tsx": "Dialog for previewing media items, supporting images, PDFs, and downloads.",
  "frontend/src/components/admin/media/MediaUploadCard.tsx": "Card for uploading media files with type validation and upload mutation handling.",
  "frontend/src/components/admin/modules/BackupSecurityModuleView.tsx": "Page showing backup download tools and tabs for activity logs and login history.",
  "frontend/src/components/admin/modules/DashboardOverviewView.tsx": "Displays dashboard stats for users, news, schemes, and jobs with refresh capability and a recent activity note.",
  "frontend/src/components/admin/modules/JobsModuleView.tsx": "Provides job management with list view and modal for creating or editing jobs.",
  "frontend/src/components/admin/modules/MediaLibraryModuleView.tsx": "Shows media library with upload card and list of uploaded items.",
  "frontend/src/components/admin/modules/NewsModuleView.tsx": "Manages news articles with list view and dialog for creating or editing news.",
  "frontend/src/components/admin/modules/NotificationsModuleView.tsx": "Offers tabs for composing notifications and viewing notification history.",
  "frontend/src/components/admin/modules/ReportsAnalyticsModuleView.tsx": "Displays reports dashboard for analytics and data export.",
  "frontend/src/components/admin/modules/SchemesModuleView.tsx": "Manages government schemes with list view and dialog for creating or editing schemes.",
  "frontend/src/components/admin/modules/UsersModuleView.tsx": "Handles user management including list, creation/editing dialog, and user details drawer.",
  "frontend/src/components/admin/modules/WebsiteSettingsModuleView.tsx": "Provides website settings form with loading state and logo picker dialog.",
  "frontend/src/components/admin/news/NewsForm.tsx": "Form for creating or updating news articles with validation and mutation handling.",
  "frontend/src/components/admin/news/NewsList.tsx": "Displays searchable news table with edit, publish, and delete actions plus confirmation dialog.",
  "frontend/src/components/admin/notifications/NotificationComposer.tsx": "Form UI for composing notifications, selecting recipients, and submitting via createNotification hook with validation.",
  "frontend/src/components/admin/notifications/NotificationsHistoryList.tsx": "Displays a table of past notifications with message, recipient count, and timestamp, using notifications history data.",
  "frontend/src/components/admin/reports/ReportsDashboard.tsx": "Dashboard showing user/news stats and buttons to export users and news as CSV files.",
  "frontend/src/components/admin/schemes/SchemeForm.tsx": "Form for creating or updating a scheme with validation and submission to create/update hooks.",
  "frontend/src/components/admin/schemes/SchemesList.tsx": "Lists schemes with search, edit, and delete options using a data table and confirmation dialog.",
  "frontend/src/components/admin/security/ActivityLogTable.tsx": "Shows all admin activity logs in a table with timestamps, principals, types, and details.",
  "frontend/src/components/admin/security/BackupDownloadCard.tsx": "Card with a button to trigger system data backup export using exportBackup hook.",
  "frontend/src/components/admin/security/LoginHistoryTable.tsx": "Displays filtered login/logout activities from admin logs in a table format.",
  "frontend/src/components/admin/settings/LogoPickerDialog.tsx": "Dialog for selecting and saving a logo from available image media using website settings update API.",
  "frontend/src/components/admin/settings/WebsiteSettingsForm.tsx": "Form to edit website settings like name, tagline, contact info, SEO fields, and open the logo picker.",
  "frontend/src/components/admin/users/UserDetailsDrawer.tsx": "Drawer that displays full user details with role, status, and edit option.",
  "frontend/src/components/admin/users/UserFormDialog.tsx": "Dialog for creating or editing a user with validation and save actions.",
  "frontend/src/components/admin/users/UsersList.tsx": "User list table with search, view, edit, and status toggle controls.",
  "frontend/src/components/app/AppErrorBoundary.tsx": "Error boundary that shows a fallback UI with reload option and error details.",
  "frontend/src/components/auth/LoginFooter.tsx": "Footer for login pages with simple navigation buttons and copyright text.",
  "frontend/src/components/auth/MemberLoginCard.tsx": "UI-only login card with mobile, OTP, password, and remember-me options that navigates to the dashboard.",
  "frontend/src/components/dashboard/DashboardLayout.tsx": "Main dashboard layout managing navbar, sidebar, mobile toggles, and routing between user and admin content.",
  "frontend/src/components/dashboard/DashboardMainContent.tsx": "Displays welcome info, profile completion, quick overview cards, and recent activity items.",
  "frontend/src/components/dashboard/DashboardNavbar.tsx": "Top navbar with search, notifications, user menu, and logout handling based on identity and role.",
  "frontend/src/components/dashboard/DashboardRightPanel.tsx": "Right-side panel showing quick links and a list of announcements with priorities.",
  "frontend/src/components/dashboard/DashboardSidebar.tsx": "Sidebar navigation listing user or admin menu items with active highlighting and mobile support.",
  "frontend/src/components/notifications/NotificationLauncherButton.tsx": "Button that opens notifications and shows an unread count badge.",
  "frontend/src/components/notifications/NotificationPanel.tsx": "A sliding notification panel that displays, marks, and clears notifications with overlay and keyboard handling.",
  "frontend/src/components/notifications/NotificationPanelErrorBoundary.tsx": "Error boundary that suppresses rendering errors for the notification panel and logs them.",
  "frontend/src/components/site/BrandLogo.tsx": "Renders the brand image logo with size variants and a fallback placeholder if loading fails.",
  "frontend/src/components/site/SiteFooter.tsx": "Footer displaying branding, support email, copyright text, and a referral link.",
  "frontend/src/components/site/SiteLayout.tsx": "Page layout wrapper providing main content area and a footer.",
  "frontend/src/components/site/TextLogo.tsx": "Text-based logo component with size and color variants.",
  "frontend/src/hooks/admin/jobs.ts": "React Query hooks for CRUD operations on jobs via the backend actor and auto-invalidating job queries.",
  "frontend/src/hooks/admin/media.ts": "Hooks for fetching, uploading, and deleting media items, including file-to-blob conversion.",
  "frontend/src/hooks/admin/news.ts": "Hooks managing news CRUD and publish actions, refreshing news queries on changes.",
  "frontend/src/hooks/admin/notifications.ts": "Hooks for creating admin notifications and fetching placeholder notification history.",
  "frontend/src/hooks/admin/schemes.ts": "Hooks providing CRUD operations for schemes with automatic query invalidation.",
  "frontend/src/hooks/admin/security.ts": "Hooks to fetch sorted admin activity logs and export backups as downloadable JSON files.",
  "frontend/src/hooks/admin/settings.ts": "Hooks to load and update website settings identified by a fixed settings ID.",
  "frontend/src/hooks/admin/useAdminAuth.ts": "Hooks checking the caller’s role and admin status using backend actor queries.",
  "frontend/src/hooks/admin/users.ts": "Provides React Query hooks for CRUD operations on users via the backend actor, with automatic query invalidation.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages the backend actor based on Internet Identity, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useExampleNotifications.ts": "Implements a local notifications system with sample data and helpers for dismissing, clearing, and marking notifications read.",
  "frontend/src/hooks/useInternetIdentity.ts": "Handles Internet Identity authentication state, loading stored identities, and exposing login and clear methods through context.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file exporting nothing for future query hooks.",
  "frontend/src/index.css": "Defines Tailwind CSS layers, theme variables, and utility classes for light/dark modes and visual effects.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Renders the admin dashboard within a route guard using the dashboard layout.",
  "frontend/src/pages/AdminLoginPage.tsx": "Provides an Internet Identity–based admin login screen with error handling and navigation.",
  "frontend/src/pages/HomePage.tsx": "Implements the home page with hero content, category sections, and notification panel integration.",
  "frontend/src/pages/MemberLoginPage.tsx": "Renders the member login page with a background image, branding, login card, and footer, handling fallback when the background fails to load.",
  "frontend/src/pages/UserDashboardPage.tsx": "Wraps the user dashboard layout component and passes navigation props with non-admin mode enabled.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL and session parameters, supporting both query and hash routing.",
  "frontend/src/utils/userRole.ts": "Defines utilities for checking admin roles and converting user role enums into readable labels.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, typography, animations, and container settings for the project.",
  "project_state.json": "Stores project metadata, scope, requirements, issues, and architectural notes for the Smart Janghai application."
}