{
  "backend/main.mo": "Empty Motoko actor with no implemented methods.",
  "feature_evidence.json": "Feature evidence report listing UI branding-removal changes and logo-fallback behavior with linked files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of major frontend files describing their roles, styling, and branding updates.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color tokens and theme variables for light and dark mode.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root component wrapping HomePage with AppErrorBoundary.",
  "frontend/src/assets/generatedAssets.ts": "Exports constants for generated logo and hero background asset paths.",
  "frontend/src/components/app/AppErrorBoundary.tsx": "Error boundary that shows a styled fallback UI with reload capability when render errors occur.",
  "frontend/src/components/site/BrandLogo.tsx": "Logo component rendering the image with size variants and a non-text visual fallback on load failure.",
  "frontend/src/components/site/SiteFooter.tsx": "Footer displaying BrandLogo, support email, copyright, and caffeine.ai attribution.",
  "frontend/src/components/site/SiteLayout.tsx": "Layout wrapper providing page structure with main content and footer.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an authenticated or anonymous backend actor and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity auth context handling login, identity loading, and status management using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Placeholder module for future backend query hooks.",
  "frontend/src/index.css": "Global Tailwind theme defining emerald/teal palette, warm neutrals, and dark-mode variants.",
  "frontend/src/main.tsx": "React entry point initializing QueryClient, wrapping the app with InternetIdentityProvider, and rendering to root.",
  "frontend/src/pages/HomePage.tsx": "Implements the homepage layout with a hero section using a background image, brand logo, intro text, and feature cards.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, typography, plugins, and container settings for the frontend.",
  "project_state.json": "Stores project metadata, requirements, issues, and notes describing the Smart Janghai website build state."
}