{
  "backend/main.mo": "Empty Motoko actor with no methods.",
  "feature_evidence.json": "Feature evidence report listing branding-related features, affected files, components, tests, and confidence.",
  "frontend-file-summaries.txt": "Prewritten summaries of key frontend files providing high-level descriptions.",
  "frontend/index.css": "Tailwind base stylesheet defining neutral and primary color variables plus dark mode overrides.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Wraps HomePage in AppErrorBoundary as the root app component.",
  "frontend/src/assets/generatedAssets.ts": "Exports static paths for logo and hero background images.",
  "frontend/src/components/app/AppErrorBoundary.tsx": "Error boundary displaying a fallback UI with reload option and optional error details.",
  "frontend/src/components/site/BrandLogo.tsx": "Renders the logo image with size options and text fallback on load failure.",
  "frontend/src/components/site/SiteFooter.tsx": "Footer with logo, support email, copyright, and caffeine.ai attribution.",
  "frontend/src/components/site/SiteLayout.tsx": "Page layout wrapper providing main content area and footer.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity context/provider managing login, stored identities, and status handling.",
  "frontend/src/hooks/useQueries.ts": "Placeholder for future React Query hooks.",
  "frontend/src/index.css": "Tailwind base stylesheet defining warm neutral and emerald/teal design tokens for light/dark modes.",
  "frontend/src/main.tsx": "App entrypoint setting up QueryClient, InternetIdentityProvider, and rendering App.",
  "frontend/src/pages/HomePage.tsx": "Implements the homepage with a hero image, branding, introduction text, and feature cards using Tailwind and custom UI components.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, animations, and container settings, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing requirements, architecture notes, known issues, and existing features for the Smart Janghai website."
}