{
  "backend/main.mo": "Defines the main actor with all platform data types, storage maps, authorization mixins, and activity logging for users, news, jobs, media, notifications, settings, and voting results.",
  "backend/migration.mo": "Provides a migration module that adds an empty votingResults map when converting old actor state to the new format.",
  "feature_evidence.json": "Contains feature evidence metadata listing implemented features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Includes prewritten summaries of multiple frontend files for reference in build planning.",
  "frontend/index.css": "Defines global Tailwind-based CSS variables for colors, themes, and base styles including light and dark mode palettes.",
  "frontend/index.html": "Minimal HTML template that loads the root React app via main.tsx.",
  "frontend/src/App.tsx": "Main React entry component handling hash routing, system decommission check, and conditional rendering of all pages with error boundary.",
  "frontend/src/assets/generatedAssets.ts": "Exports static asset paths for logo, hero background, and login background images.",
  "frontend/src/components/admin/AccessDeniedView.tsx": "Renders an access denied card for unauthorized admin access with a button to return home.",
  "frontend/src/components/admin/AdminAuthErrorView.tsx": "Displays an admin authentication error with retry and navigation options.",
  "frontend/src/components/admin/AdminModuleRouter.tsx": "Renders different admin module views based on the active module key.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Guards admin routes by checking identity and admin status, showing loaders, errors, or access denied as needed.",
  "frontend/src/components/admin/common/AdminDataTable.tsx": "Reusable searchable data table component with configurable columns and empty state.",
  "frontend/src/components/admin/common/DeleteConfirmDialog.tsx": "Confirmation dialog for delete actions with loading state support.",
  "frontend/src/components/admin/common/FormErrorText.tsx": "Displays a small inline error message with an icon.",
  "frontend/src/components/admin/jobs/JobForm.tsx": "Form for creating or updating job postings with validation and mutation handling.",
  "frontend/src/components/admin/jobs/JobsList.tsx": "Lists job postings with search, status display, edit and delete actions, and delete confirmation.",
  "frontend/src/components/admin/media/MediaList.tsx": "Displays uploaded media with search, type filtering, previewing, and deletion.",
  "frontend/src/components/admin/media/MediaPreviewDialog.tsx": "Dialog to preview or download image and PDF media files.",
  "frontend/src/components/admin/media/MediaUploadCard.tsx": "Provides a file upload UI with validation, progress display, and integration with the media upload mutation.",
  "frontend/src/components/admin/modules/BackupSecurityModuleView.tsx": "Displays backup download options and tabs for viewing activity logs and login history.",
  "frontend/src/components/admin/modules/DashboardOverviewView.tsx": "Shows dashboard metrics and recent activity with refresh support and activity type labeling.",
  "frontend/src/components/admin/modules/JobsModuleView.tsx": "Manages job listings with a list view and dialog for creating or editing jobs.",
  "frontend/src/components/admin/modules/MediaLibraryModuleView.tsx": "Displays the media library with upload controls and a list of stored media.",
  "frontend/src/components/admin/modules/NewsModuleView.tsx": "Manages news articles with list view and dialog-driven creation and editing.",
  "frontend/src/components/admin/modules/NotificationsModuleView.tsx": "Provides tabs for composing notifications and viewing notification history.",
  "frontend/src/components/admin/modules/ReportsAnalyticsModuleView.tsx": "Shows analytics and reporting features through a reports dashboard.",
  "frontend/src/components/admin/modules/SchemesModuleView.tsx": "Manages government schemes with listing and dialog-based create/edit functionality.",
  "frontend/src/components/admin/modules/UsersModuleView.tsx": "Manages users with list, create/edit dialog, and user details drawer.",
  "frontend/src/components/admin/modules/VotingResultsModuleView.tsx": "Handles listing and editing of village voting results with a form dialog.",
  "frontend/src/components/admin/modules/WebsiteSettingsModuleView.tsx": "Displays and edits website settings with logo picker integration and loading skeletons.",
  "frontend/src/components/admin/news/FeaturedImagePickerDialog.tsx": "Dialog for selecting a featured image by browsing, searching, and choosing from uploaded media.",
  "frontend/src/components/admin/news/NewsForm.tsx": "Form component for creating and editing news articles with validation, image selection, and mutation handling.",
  "frontend/src/components/admin/news/NewsList.tsx": "Displays a searchable list of news articles with edit, publish, and delete actions.",
  "frontend/src/components/admin/notifications/NotificationComposer.tsx": "Provides a form to compose and send notifications to all users or selected recipients with validation.",
  "frontend/src/components/admin/notifications/NotificationsHistoryList.tsx": "Shows a history of sent notifications with timestamps, recipients count, and delivery status.",
  "frontend/src/components/admin/reports/ReportsDashboard.tsx": "Dashboard showing user and news statistics with CSV export options for users and news data.",
  "frontend/src/components/admin/schemes/DocumentsPickerDialog.tsx": "Dialog for searching and selecting PDF or document media items with temporary selection state.",
  "frontend/src/components/admin/schemes/SchemeForm.tsx": "Form component to create or update a scheme with validation, document selection, and mutation handling.",
  "frontend/src/components/admin/schemes/SchemesList.tsx": "Displays a searchable table of schemes with edit and delete actions and a confirmation dialog.",
  "frontend/src/components/admin/security/ActivityLogTable.tsx": "Shows a table of all admin activity logs with timestamps, principals, types, and details.",
  "frontend/src/components/admin/security/BackupDownloadCard.tsx": "Provides a button to trigger full system data export with loading feedback.",
  "frontend/src/components/admin/security/LoginHistoryTable.tsx": "Lists login and logout activities filtered from admin activity logs.",
  "frontend/src/components/admin/settings/LogoPickerDialog.tsx": "Dialog for selecting an image from media to set as the website logo and saving updated settings.",
  "frontend/src/components/admin/settings/WebsiteSettingsForm.tsx": "Form for editing website settings including name, tagline, contact, SEO fields, and logo selection trigger.",
  "frontend/src/components/admin/users/UserDetailsDrawer.tsx": "Drawer showing detailed user info with role assignment, status, and an edit action.",
  "frontend/src/components/admin/users/UserFormDialog.tsx": "Dialog component for creating or editing users with form validation and create/update mutations.",
  "frontend/src/components/admin/users/UsersList.tsx": "Displays a searchable list of users with actions for viewing, editing, toggling status, and deleting.",
  "frontend/src/components/admin/voting-results/VotingResultFormDialog.tsx": "Form dialog for adding or editing voting results with input validation and create/update mutations.",
  "frontend/src/components/admin/voting-results/VotingResultsList.tsx": "Shows all voting results with search, delete, and edit options, including loading and error states.",
  "frontend/src/components/app/AppErrorBoundary.tsx": "Error boundary that catches application errors and shows a reload prompt with optional error details.",
  "frontend/src/components/auth/LoginFooter.tsx": "Footer with simple About, Privacy Policy, and Contact buttons plus a copyright notice.",
  "frontend/src/components/auth/MemberLoginCard.tsx": "Member login UI allowing mobile or password login with OTP request and navigation callback.",
  "frontend/src/components/dashboard/DashboardLayout.tsx": "Main dashboard layout managing navbar, sidebar, responsive behavior, and routing between user and admin views.",
  "frontend/src/components/dashboard/DashboardMainContent.tsx": "Renders the user dashboard home with welcome text, profile progress, overview cards, and recent activities.",
  "frontend/src/components/dashboard/DashboardNavbar.tsx": "Top navigation bar with search, notifications, user menu, and logout handling with admin/user mode support.",
  "frontend/src/components/dashboard/DashboardRightPanel.tsx": "Right-hand sidebar showing quick links and announcements with priority badges.",
  "frontend/src/components/dashboard/DashboardSidebar.tsx": "Sidebar navigation listing user or admin menu items with mobile toggle and active-state handling.",
  "frontend/src/components/notifications/NotificationLauncherButton.tsx": "Notification button showing unread count badge and opening the notification panel.",
  "frontend/src/components/notifications/NotificationPanel.tsx": "Slide-in panel showing user notifications with read/unread handling and mark-all-as-read support.",
  "frontend/src/components/notifications/NotificationPanelErrorBoundary.tsx": "Error boundary that suppresses errors in the notification panel and renders nothing on failure.",
  "frontend/src/components/site/BrandLogo.tsx": "Renders a logo image with size options and a styled fallback if loading fails.",
  "frontend/src/components/site/ComingSoonRibbon.tsx": "Displays a styled announcement ribbon indicating upcoming voting results.",
  "frontend/src/components/site/LiveVotingResultsWidget.tsx": "Fetches and displays live voting results with loading, error, and empty states.",
  "frontend/src/components/site/SiteFooter.tsx": "Builds the site footer with branding, support email, copyright, and attribution.",
  "frontend/src/components/site/SiteLayout.tsx": "Provides the main page layout wrapping content with a footer.",
  "frontend/src/components/site/TextLogo.tsx": "Renders a stylized text-based logo with size and color variants.",
  "frontend/src/components/site/VotingPromoSection.tsx": "Shows a promo section highlighting live voting results and includes the results widget.",
  "frontend/src/hooks/admin/dashboard.ts": "React Query hooks for fetching dashboard metrics, recent activity, and monthly growth.",
  "frontend/src/hooks/admin/jobs.ts": "CRUD hooks for managing job listings using the actor API.",
  "frontend/src/hooks/admin/media.ts": "Hooks for listing, uploading (with progress), and deleting media items.",
  "frontend/src/hooks/admin/news.ts": "Provides hooks to list, create, update, publish, and delete news items.",
  "frontend/src/hooks/admin/notifications.ts": "Handles creating notifications and retrieving notification history.",
  "frontend/src/hooks/admin/schemes.ts": "CRUD hooks for government schemes including creation, update, and deletion.",
  "frontend/src/hooks/admin/security.ts": "Fetches admin activity logs and provides a backup export utility.",
  "frontend/src/hooks/admin/settings.ts": "Hooks for fetching and updating global website settings.",
  "frontend/src/hooks/admin/useAdminAuth.ts": "Provides React Query hooks to fetch caller role and admin status from the actor with loading state merging.",
  "frontend/src/hooks/admin/users.ts": "Defines hooks for querying and mutating user data including fetch, create, update, delete, status updates, and role assignments.",
  "frontend/src/hooks/admin/votingResults.ts": "Provides hooks to fetch and manage voting results, including create, update, and delete operations with cache invalidation.",
  "frontend/src/hooks/notifications.ts": "Implements hooks to fetch a user's notifications and mark notifications as read using the actor.",
  "frontend/src/hooks/useActor.ts": "Creates and caches the backend actor based on Internet Identity and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useExampleNotifications.ts": "Empty placeholder file for future notification hooks.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context and provider for login, logout, identity persistence, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file exporting nothing for future query hooks.",
  "frontend/src/hooks/useSystemStatus.ts": "Checks if the backend is decommissioned by attempting a minimal read call and interpreting errors.",
  "frontend/src/hooks/votingResults.ts": "Fetches voting results with polling support for live updates.",
  "frontend/src/index.css": "Tailwind configuration defining theme colors, dark mode values, and utility classes including glassmorphism styles.",
  "frontend/src/main.tsx": "Application entry point initializing React Query, Internet Identity, and rendering the app.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Wraps the admin dashboard layout with an admin route guard and navigation handling.",
  "frontend/src/pages/AdminLoginPage.tsx": "Admin login page using Internet Identity, handling login flow, errors, and navigation.",
  "frontend/src/pages/DecommissionedPage.tsx": "Displays a centered card informing users that the website is permanently decommissioned.",
  "frontend/src/pages/HomePage.tsx": "Renders the main homepage with hero section, notifications, navigation buttons, and category highlights.",
  "frontend/src/pages/MemberLoginPage.tsx": "Shows the member login screen with background image handling and login card UI.",
  "frontend/src/pages/UserDashboardPage.tsx": "Wraps the user dashboard layout and passes navigation props.",
  "frontend/src/utils/adminAuthError.ts": "Provides helpers to normalize and detect admin authorization-related errors.",
  "frontend/src/utils/hashRouting.ts": "Implements hash-based routing utilities to parse, convert, and update page routes.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, and clearing URL and session parameters, including hash query support.",
  "frontend/src/utils/userRole.ts": "Contains helpers to check admin roles and convert user roles to readable labels.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, typography, animations, and plugin usage.",
  "project_state.json": "Stores project metadata, feature requirements, and pending requests for homepage voting features."
}