{
  "backend/main.mo": "Defines the main actor with data models, maps for all entities, authorization and storage mixins, and decommission-state handling logic.",
  "backend/migration.mo": "Provides a migration module that resets users and initializes decommissioned=false when upgrading.",
  "feature_evidence.json": "Feature evidence report listing files, components, and tests related to the decommissioned frontend screen feature.",
  "frontend-file-summaries.txt": "Prewritten summaries describing various frontend files and their roles in navigation, UI, notifications, and layout.",
  "frontend/index.css": "Tailwind base layer defining CSS variables for light/dark themes and applying global background/foreground styles.",
  "frontend/index.html": "Basic HTML entry file mounting the React root and loading main.tsx.",
  "frontend/src/App.tsx": "Root component handling hash-based routing, decommission status checks, and conditional rendering of pages.",
  "frontend/src/assets/generatedAssets.ts": "Exports constants for generated static asset file paths.",
  "frontend/src/components/admin/AccessDeniedView.tsx": "UI view showing an access denied message with a button to return home.",
  "frontend/src/components/admin/AdminAuthErrorView.tsx": "UI view for admin authentication errors with retry and navigation options.",
  "frontend/src/components/admin/AdminModuleRouter.tsx": "Routes admin module keys to their corresponding admin module components.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Protects admin routes by checking authentication and admin status, showing loading, error, or denial views as appropriate.",
  "frontend/src/components/admin/common/AdminDataTable.tsx": "Reusable searchable data table component with configurable columns and empty state handling.",
  "frontend/src/components/admin/common/DeleteConfirmDialog.tsx": "Confirmation dialog for delete actions with optional loading state.",
  "frontend/src/components/admin/common/FormErrorText.tsx": "Displays a small error message with an icon for form validation.",
  "frontend/src/components/admin/jobs/JobForm.tsx": "Form for creating and editing jobs with validation, mutation handlers, and timestamp conversion.",
  "frontend/src/components/admin/jobs/JobsList.tsx": "Lists jobs with search, status display, editing, and deletion via a data table.",
  "frontend/src/components/admin/media/MediaList.tsx": "Displays searchable and filterable media grid with preview and delete options.",
  "frontend/src/components/admin/media/MediaPreviewDialog.tsx": "Dialog showing image or PDF previews with download support.",
  "frontend/src/components/admin/media/MediaUploadCard.tsx": "Card for uploading media files with validation, progress tracking, and mutation integration.",
  "frontend/src/components/admin/modules/BackupSecurityModuleView.tsx": "Backup and security module view showing backup download and activity/login logs in tabs.",
  "frontend/src/components/admin/modules/DashboardOverviewView.tsx": "Renders admin dashboard metrics and recent activity with refresh, loading states, and activity label mapping.",
  "frontend/src/components/admin/modules/JobsModuleView.tsx": "Provides job management UI with list, create/edit dialog, and form handling.",
  "frontend/src/components/admin/modules/MediaLibraryModuleView.tsx": "Displays media upload card and media list for managing uploaded files.",
  "frontend/src/components/admin/modules/NewsModuleView.tsx": "Manages news articles with list view and create/edit dialog using NewsForm.",
  "frontend/src/components/admin/modules/NotificationsModuleView.tsx": "Provides tabs for composing notifications and viewing notification history.",
  "frontend/src/components/admin/modules/ReportsAnalyticsModuleView.tsx": "Wraps the reports dashboard for viewing analytics and exporting data.",
  "frontend/src/components/admin/modules/SchemesModuleView.tsx": "Handles creation and editing of government schemes with list and modal form.",
  "frontend/src/components/admin/modules/UsersModuleView.tsx": "Manages users with list view, create/edit dialog, and a user details drawer.",
  "frontend/src/components/admin/modules/WebsiteSettingsModuleView.tsx": "Displays and edits website settings with loading skeletons and logo picker dialog.",
  "frontend/src/components/admin/news/FeaturedImagePickerDialog.tsx": "Dialog for selecting an image from media, with search, filtering, and selection state.",
  "frontend/src/components/admin/news/NewsForm.tsx": "Form for creating or updating news items with validation, tag parsing, and featured image selection.",
  "frontend/src/components/admin/news/NewsList.tsx": "Displays a searchable list of news with edit, publish, and delete actions using data table and confirmation dialog.",
  "frontend/src/components/admin/notifications/NotificationComposer.tsx": "Form for composing and sending notifications to all users or selected users with validation and submission handling.",
  "frontend/src/components/admin/notifications/NotificationsHistoryList.tsx": "Shows past notifications with delivery status, recipient count, and timestamp, with loading skeletons.",
  "frontend/src/components/admin/reports/ReportsDashboard.tsx": "Dashboard displaying user and news statistics and providing CSV export for users and news data.",
  "frontend/src/components/admin/schemes/DocumentsPickerDialog.tsx": "Dialog for searching and selecting document-type media items with temporary selection and filtering.",
  "frontend/src/components/admin/schemes/SchemeForm.tsx": "Form for creating or updating schemes with validation and support for attaching documents via a picker dialog.",
  "frontend/src/components/admin/schemes/SchemesList.tsx": "Displays a searchable list of schemes with edit and delete actions using admin scheme hooks.",
  "frontend/src/components/admin/security/ActivityLogTable.tsx": "Shows a table of admin activity logs with timestamps, principals, types, and details.",
  "frontend/src/components/admin/security/BackupDownloadCard.tsx": "Provides a card UI to trigger a full system backup download with loading feedback.",
  "frontend/src/components/admin/security/LoginHistoryTable.tsx": "Filters and displays admin login and logout events in a table format.",
  "frontend/src/components/admin/settings/LogoPickerDialog.tsx": "Dialog for selecting an image from media items to update the website logo.",
  "frontend/src/components/admin/settings/WebsiteSettingsForm.tsx": "Form for editing website settings including name, tagline, contact info, and SEO fields.",
  "frontend/src/components/admin/users/UserDetailsDrawer.tsx": "Drawer showing detailed user info with role assignment and edit option.",
  "frontend/src/components/admin/users/UserFormDialog.tsx": "Dialog for creating or editing users with validation and role selection.",
  "frontend/src/components/admin/users/UsersList.tsx": "Displays a searchable user list with actions for viewing, editing, toggling status, and deleting users.",
  "frontend/src/components/app/AppErrorBoundary.tsx": "React error boundary that shows an error card and allows reloading the page when a runtime error occurs.",
  "frontend/src/components/auth/LoginFooter.tsx": "Renders footer links and a copyright notice for the login screen.",
  "frontend/src/components/auth/MemberLoginCard.tsx": "UI-only member login form supporting mobile, OTP request, password login, and remember-me toggle.",
  "frontend/src/components/dashboard/DashboardLayout.tsx": "Defines the dashboard structure with navbar, sidebar, and main content, handling both member and admin modes.",
  "frontend/src/components/dashboard/DashboardMainContent.tsx": "Shows dashboard home content including welcome info, profile progress, quick overview cards, and recent activities.",
  "frontend/src/components/dashboard/DashboardNavbar.tsx": "Top navigation bar with search, notifications, user menu, identity display, and logout handling.",
  "frontend/src/components/dashboard/DashboardRightPanel.tsx": "Displays quick links and a list of announcements with priority badges in a right-side dashboard panel.",
  "frontend/src/components/dashboard/DashboardSidebar.tsx": "Renders a collapsible sidebar with user or admin menu items and handles navigation state.",
  "frontend/src/components/notifications/NotificationLauncherButton.tsx": "A button showing a bell icon that triggers opening notifications and displays unread count.",
  "frontend/src/components/notifications/NotificationPanel.tsx": "Sliding notification panel that lists user notifications, supports marking read, and handles escape/overlay closing.",
  "frontend/src/components/notifications/NotificationPanelErrorBoundary.tsx": "Error boundary that suppresses errors inside the notification panel and renders nothing on failure.",
  "frontend/src/components/site/BrandLogo.tsx": "Displays the logo image with size options and a fallback placeholder if loading fails.",
  "frontend/src/components/site/SiteFooter.tsx": "Footer showing branding, support contact, copyright, and attribution link.",
  "frontend/src/components/site/SiteLayout.tsx": "Page layout wrapper providing main content area and footer.",
  "frontend/src/components/site/TextLogo.tsx": "Renders the text-based SMART JANGHAI logo with size and color variants.",
  "frontend/src/hooks/admin/dashboard.ts": "React query hooks for fetching dashboard metrics, recent activity, and monthly growth via actor API.",
  "frontend/src/hooks/admin/jobs.ts": "React query hooks for fetching, creating, updating, and deleting jobs while keeping job data fresh.",
  "frontend/src/hooks/admin/media.ts": "React query hooks for listing, uploading, and deleting media, including upload progress support.",
  "frontend/src/hooks/admin/news.ts": "Provides React Query hooks to fetch, create, update, publish, and delete news items using the backend actor.",
  "frontend/src/hooks/admin/notifications.ts": "Implements hooks to create notifications and fetch notification history, invalidating related queries on updates.",
  "frontend/src/hooks/admin/schemes.ts": "Defines hooks for retrieving, creating, updating, and deleting schemes via backend actor operations.",
  "frontend/src/hooks/admin/security.ts": "Offers hooks to fetch sorted admin activity logs and to export backend backup data as a downloadable JSON file.",
  "frontend/src/hooks/admin/settings.ts": "Contains hooks to fetch and update website settings, refreshing cached data after updates.",
  "frontend/src/hooks/admin/useAdminAuth.ts": "Provides hooks to get the caller's role and admin status with caching and controlled refetch behavior.",
  "frontend/src/hooks/admin/users.ts": "Supplies hooks to manage users including fetching, creating, updating, deleting, and modifying roles or status.",
  "frontend/src/hooks/notifications.ts": "Includes hooks for fetching a user's notifications and marking notifications as read, keyed by user identity.",
  "frontend/src/hooks/useActor.ts": "Creates and caches the backend actor based on user identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useExampleNotifications.ts": "Empty placeholder file for future notification-related hooks.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context and provider with login, logout, identity persistence, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Placeholder exporting nothing for future query hooks.",
  "frontend/src/hooks/useSystemStatus.ts": "Fetches system decommission status by probing backend availability and interpreting specific error messages.",
  "frontend/src/index.css": "Defines Tailwind layers, theme color variables for light and dark modes, and custom utility classes including glassmorphism and soft shadows.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Renders the admin dashboard inside an admin route guard using the shared dashboard layout.",
  "frontend/src/pages/AdminLoginPage.tsx": "Provides an Internet Identity–based admin login UI and redirects to the admin dashboard upon successful authentication.",
  "frontend/src/pages/DecommissionedPage.tsx": "Displays a static notice indicating the website has been permanently decommissioned.",
  "frontend/src/pages/HomePage.tsx": "Shows the main landing page with a hero section, notifications, category cards, and navigation buttons.",
  "frontend/src/pages/MemberLoginPage.tsx": "Renders the member login page with background image handling, branding, and a login card component.",
  "frontend/src/pages/UserDashboardPage.tsx": "Displays the user dashboard using the shared dashboard layout in non-admin mode.",
  "frontend/src/utils/adminAuthError.ts": "Normalizes backend authorization errors to user-friendly messages and detects admin-related auth failures.",
  "frontend/src/utils/hashRouting.ts": "Implements simple hash-based routing utilities for parsing, generating, and updating page hashes.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL params, persisting them in sessionStorage, and managing hash-based query strings.",
  "frontend/src/utils/userRole.ts": "Contains helpers for identifying admin roles and converting UserRole values to readable labels.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, custom colors, typography, container queries, animations, and extended theme settings including radii, shadows, fonts, and keyframes.",
  "project_state.json": "Project state describing decommission-related features and requests, including a frontend decommission screen and backend decommission/data‑wipe requirements."
}