{
  "kind": "build_request",
  "title": "Replace visible SMART JANGHAI name text with the logo image",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-18",
      "text": "Replace the visible \"SMART JANGHAI\" brand-name text used for branding on the site with the existing logo image asset, so the logo image is used as the primary branding mark instead of the text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "REPLACE SMART JANGHAI NAME WITH THIS IMAGE FORMATE LOGO"
        ]
      },
      "acceptanceCriteria": [
        "The homepage hero continues to display the logo image (not a \"SMART JANGHAI\" text heading) as the primary brand mark.",
        "The footer branding area no longer renders \"SMART JANGHAI\" as a visible text heading and displays the logo image instead.",
        "The logo image used for branding is the existing static asset referenced by the app (LOGO_IMAGE = \"/assets/generated/logo.png\").",
        "Branding remains responsive and readable on mobile/tablet/desktop (logo scales appropriately and does not overflow)."
      ]
    },
    {
      "id": "REQ-19",
      "text": "Ensure there is only one visible branding logo mark in the hero/branding area at a time and that missing logo assets never cause a blank section or blank page (use the existing resilient image loading pattern).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "REPLACE SMART JANGHAI NAME WITH THIS IMAGE FORMATE LOGO"
        ]
      },
      "acceptanceCriteria": [
        "Only one logo image is visible in the hero branding area (no duplicate logos).",
        "If the logo image fails to load, the page still renders without runtime errors and without a blank screen (graceful fallback behavior is preserved)."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (read-only).",
    "Do not modify immutable hook/entry files: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx.",
    "Keep image assets served from frontend/public/assets/generated and referenced by exact filename paths (no backend image routing)."
  ],
  "nonGoals": [
    "Creating or generating a new logo image file.",
    "Changing backend (Motoko) code or adding backend endpoints.",
    "Adding authentication or any new interactive features beyond the branding swap."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}