{
  "kind": "build_request",
  "title": "Fix admin panel and options not showing (admin access + role handling)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-53",
      "text": "Fix admin authorization gating so the Admin Dashboard renders for authenticated admin principals (and is not incorrectly blocked due to mismatched role type comparisons). Update the frontend to correctly interpret the backend `UserRole` value returned by `getCallerUserRole()` and treat the admin role as authorized.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "ANY OPTION AND ADMIN PANEL NOT SHOWING"
        ]
      },
      "acceptanceCriteria": [
        "After signing in with Internet Identity, a principal with admin role is allowed through `AdminRouteGuard` and the admin dashboard content renders (no perpetual loading, no incorrect Access Denied).",
        "A principal without admin role is blocked and sees the existing Access Denied screen.",
        "The role check does not rely on comparing `UserRole` to the string literal 'admin' if the backend returns a variant/union type; the check works with the actual returned shape from the generated candid types."
      ]
    },
    {
      "id": "REQ-54",
      "text": "Add a user-visible, non-blank failure state for admin-auth checks when the role query fails (e.g., backend trap, network error, actor unavailable). The admin page must render a clear English error message with a retry action and a 'Back to Home' action instead of staying blank or stuck on an infinite loader.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "ANY OPTION AND ADMIN PANEL NOT SHOWING"
        ]
      },
      "acceptanceCriteria": [
        "If the role query errors, the admin route guard shows an error card (English text) with a Retry button that refetches the role query and a Back to Home button.",
        "The page never becomes completely blank due to admin-auth query errors or unexpected role values."
      ]
    },
    {
      "id": "REQ-55",
      "text": "Ensure there is a clear navigation path to the Admin Login and Admin Dashboard from within the running app UI (not only via internal state changes), so users can reach the admin panel reliably after deployment or refresh.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "ANY OPTION AND ADMIN PANEL NOT SHOWING"
        ]
      },
      "acceptanceCriteria": [
        "From the Home page UI, there is a visible way to open the Admin Login screen using existing `onNavigate` navigation (English label).",
        "From Admin Login, successful sign-in navigates to the Admin Dashboard and the sidebar menu with admin options is visible on desktop and accessible on mobile via the existing toggle button."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/hooks/useInternetIdentity.ts or frontend/src/hooks/useActor.ts (immutable paths).",
    "Keep the backend as a single Motoko actor in backend/main.mo; only introduce migration.mo if state changes require it."
  ],
  "nonGoals": [
    "Do not implement Node/Express/MongoDB/JWT-based authentication (not supported on this platform).",
    "Do not add new admin modules beyond the existing sidebar options; this request is limited to making the current admin panel/options show reliably."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}