{
  "kind": "build_request",
  "title": "Remove remaining Smart Janghai branding text and rely on logo-only branding",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-20",
      "text": "Remove any visible “SMART JANGHAI” / “Smart Janghai” branding text from the UI so the site branding is logo-only (no brand-name text shown in the hero branding area or footer).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "YES REMOVE TEXT"
        ]
      },
      "acceptanceCriteria": [
        "The hero branding area does not display any brand-name text (only the logo image is shown).",
        "The footer does not display the brand name text (e.g., remove/replace the “© {year} Smart Janghai. All rights reserved.” wording so it no longer contains the brand name).",
        "No other new user-facing text is introduced as a substitute for the removed brand-name text."
      ]
    },
    {
      "id": "REQ-21",
      "text": "Update the BrandLogo component so that if the logo image fails to load, it does not fall back to showing the brand-name text; instead render a non-text fallback that preserves layout and does not cause a blank/empty page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "YES REMOVE TEXT"
        ]
      },
      "acceptanceCriteria": [
        "If the logo image path is invalid or the image fails to load, the component renders a simple non-text placeholder (e.g., a neutral shape/container) and the page remains fully rendered.",
        "The fallback does not contain “SMART JANGHAI” or “Smart Janghai” text."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend immutablePaths (e.g., frontend/src/main.tsx, frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/components/ui).",
    "Keep the existing resilient image-loading approach so missing assets never cause a blank section or blank page."
  ],
  "nonGoals": [
    "Do not change the hero background image asset or its path.",
    "Do not redesign the overall homepage layout or rewrite non-branding informational copy beyond removing brand-name text.",
    "No backend changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}