{
  "kind": "build_request",
  "title": "Fix homepage sections not rendering and add visible error states",
  "projectName": "Smart Janghai",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the app-wide loading gate so the UI does not get stuck on the global “Loading…” screen when the backend actor is temporarily null/unavailable during initialization; the Home page (and other routes) must still render in a fail-open manner unless the backend explicitly reports decommissioning.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "ANYTHING NOT SHOWING ACCORDING ME"
        ]
      },
      "acceptanceCriteria": [
        "When the backend actor is not yet ready, the app renders the Home page instead of an indefinite full-screen loading state.",
        "If the backend is decommissioned (trap message contains \"decommissioned\" or \"Service Unavailable\"), the Decommissioned page still renders reliably.",
        "The app does not poll the URL hash at a high frequency while in a non-interactive loading state (no unnecessary 100ms loop contributing to perceived blank/\"not showing\" behavior)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the top-of-homepage VotingPromoSection (including LivePollWidget and LiveVotingResultsWidget) always displays a clear UI state for loading, empty data, and errors instead of rendering nothing; all user-facing messages must be in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "ANYTHING NOT SHOWING ACCORDING ME"
        ]
      },
      "acceptanceCriteria": [
        "On the Home page, the VotingPromoSection is visible at the top of the page on first load (regardless of whether a poll exists).",
        "If live poll/voting result queries fail, the user sees a readable inline error message in the widget area (not a blank section).",
        "If there is no active poll, the user sees the existing “No Active Poll” state (or equivalent) instead of empty space."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Replace silent rendering failures with visible fallbacks for notification UI: if NotificationPanelErrorBoundary catches an error, show a small inline fallback message (in English) rather than returning null so users do not experience missing UI with no explanation.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "ANYTHING NOT SHOWING ACCORDING ME"
        ]
      },
      "acceptanceCriteria": [
        "If the notification panel subtree throws, the page still loads and a compact fallback message is shown where the notification launcher/panel would appear.",
        "Console logging remains for debugging, but the user also gets an on-screen indication that notifications failed to load.",
        "Normal (non-error) behavior of notification launcher and panel is unchanged."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui or any paths listed as immutable in SYSTEM_CONTEXT (compose components instead).",
    "Keep all user-facing text in English."
  ],
  "nonGoals": [
    "Do not add new voting/poll features beyond making existing sections reliably visible.",
    "Do not change backend schemas or require a migration unless a concrete backend rendering blocker is identified and confirmed."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}