{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Decommission mode frontend route override + decommissioned screen",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Add a global decommission-state check and render a single English “Website Decommissioned” screen that overrides all routes when the backend reports the site is decommissioned.",
      "acceptanceCriteria": [
        "On initial load (and when navigating), the frontend checks backend system status and detects decommission mode",
        "If decommission mode is ON, the app renders only the decommissioned screen regardless of URL hash/route",
        "The decommissioned screen contains only English user-facing text and does not expose any admin/member functionality (no login actions)",
        "The decommissioned screen renders without relying on protected APIs that will be blocked in decommission mode (i.e., it must not crash due to blocked feature calls)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/DecommissionedPage.tsx",
          "operation": "create",
          "description": "Create a dedicated full-page “Website Decommissioned” view containing only English informational text (no login buttons, no navigation actions, no member/admin features). Use existing shadcn-ui components (e.g., Card/Button typography primitives as needed) for consistent styling; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useSystemStatus.ts",
          "operation": "create",
          "description": "Add a React Query hook that uses the existing core-infrastructure actor setup (via useActor) to fetch a minimal system status with an isDecommissioned flag, and returns a safe default (not decommissioned) if the status call is unavailable or fails. This hook must avoid calling any protected/feature APIs so it remains functional during decommission mode; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Extend the frontend backend interface typings to include the minimal read-only system status capability used by the decommission check (e.g., a getSystemStatus() returning an object containing isDecommissioned). Keep it read-only and minimal to support the route override; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the decommission check into the root app: call the new useSystemStatus hook on initial load and ensure it re-checks on hash-route changes, then override renderPage to always render DecommissionedPage when isDecommissioned is true (regardless of current URL hash). Ensure normal pages are not mounted in decommission mode to prevent crashes from blocked feature calls; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}