{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Swap SMART JANGHAI text branding to logo image with resilient fallback",
  "requirements": [
    {
      "id": "REQ-18",
      "summary": "Replace visible SMART JANGHAI branding text in the UI with the existing logo image asset as the primary brand mark (hero + footer).",
      "acceptanceCriteria": [
        "The homepage hero continues to display the logo image (not a \"SMART JANGHAI\" text heading) as the primary brand mark.",
        "The footer branding area no longer renders \"SMART JANGHAI\" as a visible text heading and displays the logo image instead.",
        "The logo image used for branding is the existing static asset referenced by the app (LOGO_IMAGE = \"/assets/generated/logo.png\").",
        "Branding remains responsive and readable on mobile/tablet/desktop (logo scales appropriately and does not overflow)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/site/BrandLogo.tsx",
          "operation": "create",
          "description": "Create a reusable brand logo component that renders the existing LOGO_IMAGE (/assets/generated/logo.png) as the primary mark with responsive sizing controls suitable for hero and footer usage."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Update the hero branding area to use the new BrandLogo component (instead of any text heading) while keeping the logo as the primary brand mark and ensuring responsive sizing matches the current design intent."
        },
        {
          "path": "frontend/src/components/site/SiteFooter.tsx",
          "operation": "modify",
          "description": "Replace the visible \"SMART JANGHAI\" footer branding text heading with the BrandLogo component, keeping the tagline and other footer content intact and ensuring the logo scales appropriately without overflow."
        }
      ]
    },
    {
      "id": "REQ-19",
      "summary": "Ensure only one visible hero branding mark at a time and preserve graceful rendering if the logo asset fails to load.",
      "acceptanceCriteria": [
        "Only one logo image is visible in the hero branding area (no duplicate logos).",
        "If the logo image fails to load, the page still renders without runtime errors and without a blank screen (graceful fallback behavior is preserved)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/site/BrandLogo.tsx",
          "operation": "create",
          "description": "Implement a resilient image loading pattern inside BrandLogo: show exactly one visible branding mark at a time (image or fallback) and provide a non-blank, non-crashing visual fallback when the logo fails to load."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Remove any ad-hoc logo error state/rendering in the hero and rely on BrandLogo so the hero never shows duplicate marks and maintains graceful fallback behavior if the asset fails to load."
        },
        {
          "path": "frontend/src/components/site/SiteFooter.tsx",
          "operation": "modify",
          "description": "Use BrandLogo for footer branding so missing logo assets do not create an empty/blank branding area and the footer continues to render safely."
        }
      ]
    }
  ]
}