{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove remaining Smart Janghai text branding and ensure non-text logo fallback",
  "requirements": [
    {
      "id": "REQ-20",
      "summary": "Remove visible “SMART JANGHAI” / “Smart Janghai” branding text so branding is logo-only in hero and footer.",
      "acceptanceCriteria": [
        "The hero branding area does not display any brand-name text (only the logo image is shown).",
        "The footer does not display the brand name text (e.g., remove/replace the “© {year} Smart Janghai. All rights reserved.” wording so it no longer contains the brand name).",
        "No other new user-facing text is introduced as a substitute for the removed brand-name text."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/site/SiteFooter.tsx",
          "operation": "modify",
          "description": "Remove the brand-name text from the footer copyright line while keeping the rest of the footer content unchanged (no new substitute brand text)."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Remove/avoid any user-visible brand-name text in the hero branding area by ensuring hero image alt text does not contain the brand name (so broken-image fallback text never shows the brand). Also remove the visible brand-name words from the CTA title without introducing new substitute text."
        }
      ]
    },
    {
      "id": "REQ-21",
      "summary": "Update BrandLogo so image load failure uses a non-text placeholder fallback that preserves layout.",
      "acceptanceCriteria": [
        "If the logo image path is invalid or the image fails to load, the component renders a simple non-text placeholder (e.g., a neutral shape/container) and the page remains fully rendered.",
        "The fallback does not contain “SMART JANGHAI” or “Smart Janghai” text."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/site/BrandLogo.tsx",
          "operation": "modify",
          "description": "Replace the current text fallback with a non-text visual placeholder (e.g., neutral rounded container/skeleton) that matches the selected size height to preserve layout and maintains the resilient image-loading behavior; also ensure the rendered image metadata (alt/labels) does not include the brand name to avoid showing it on image failure."
        }
      ]
    }
  ]
}