{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix admin access gating, error handling, and in-app navigation to admin",
  "requirements": [
    {
      "id": "REQ-53",
      "summary": "Correct admin authorization gating by interpreting `getCallerUserRole()` using the generated candid type shape (not brittle string comparisons) so admin principals can access the Admin Dashboard.",
      "acceptanceCriteria": [
        "After signing in with Internet Identity, a principal with admin role is allowed through `AdminRouteGuard` and the admin dashboard content renders (no perpetual loading, no incorrect Access Denied).",
        "A principal without admin role is blocked and sees the existing Access Denied screen.",
        "The role check does not rely on comparing `UserRole` to the string literal 'admin' if the backend returns a variant/union type; the check works with the actual returned shape from the generated candid types."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/userRole.ts",
          "operation": "create",
          "description": "Add a small role-normalization helper that safely interprets the `UserRole` value returned from the backend (handling enum/variant-like shapes defensively) and exposes a boolean `isAdminRole(...)` (and optionally a `toRoleLabel(...)`) for consistent checks across the UI."
        },
        {
          "path": "frontend/src/components/admin/AdminRouteGuard.tsx",
          "operation": "modify",
          "description": "Update the admin role gating to use the shared role-normalization helper (e.g., `isAdminRole(role)`) instead of `role !== 'admin'`, ensuring authenticated admins render children and non-admins still see `AccessDeniedView`. Use existing shadcn/ui Card/Button patterns where needed; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/dashboard/DashboardNavbar.tsx",
          "operation": "modify",
          "description": "Update role display/labeling logic to use the shared role-normalization helper instead of comparing `role` to string literals, preventing mismatches in admin/user/guest labeling. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-54",
      "summary": "Show a clear, non-blank failure state when the admin role query fails, with Retry and Back to Home actions.",
      "acceptanceCriteria": [
        "If the role query errors, the admin route guard shows an error card (English text) with a Retry button that refetches the role query and a Back to Home button.",
        "The page never becomes completely blank due to admin-auth query errors or unexpected role values."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/AdminAuthErrorView.tsx",
          "operation": "create",
          "description": "Create a reusable admin-auth error view that renders an English error message in a card and provides two actions: Retry (calls a passed `onRetry`) and Back to Home (calls `onNavigate('home')`). Build the UI using existing shadcn/ui components (Card/Button/Alert as appropriate); verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/AdminRouteGuard.tsx",
          "operation": "modify",
          "description": "Handle role-query failures by rendering the new `AdminAuthErrorView` when the role query is in an error state; wire the Retry button to `refetch()` from `useGetCallerRole()` and Back to Home to existing navigation. Also ensure unexpected/unknown role values fall back to a visible non-blank state (AccessDenied or error view as appropriate). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/admin/useAdminAuth.ts",
          "operation": "modify",
          "description": "Ensure the `useGetCallerRole()` hook exposes the query error state and a refetch capability to support the AdminRouteGuard Retry action (keep `retry: false` so the UI controls retries explicitly)."
        }
      ]
    },
    {
      "id": "REQ-55",
      "summary": "Add clear in-app navigation to reach Admin Login and ensure successful admin sign-in lands on Admin Dashboard with admin sidebar options available.",
      "acceptanceCriteria": [
        "From the Home page UI, there is a visible way to open the Admin Login screen using existing `onNavigate` navigation (English label).",
        "From Admin Login, successful sign-in navigates to the Admin Dashboard and the sidebar menu with admin options is visible on desktop and accessible on mobile via the existing toggle button."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Add a visible Home page navigation action labeled in English (e.g., \"Admin Login\") that uses existing `onNavigate('admin-login')`. Update the `HomePageProps` `onNavigate` type to include admin pages so the call is type-safe. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Align page-type wiring so Home can navigate to `admin-login` (and any necessary type adjustments) without breaking existing navigation. Ensure `admin-login` continues to render `AdminLoginPage` and `admin-dashboard` renders `AdminDashboardPage`."
        }
      ]
    }
  ]
}