{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix fail-open app initialization and add visible error/empty states for home sections",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make app initialization fail-open so routes render without getting stuck on a global loading screen; keep decommission detection reliable and remove high-frequency hash polling.",
      "acceptanceCriteria": [
        "When the backend actor is not yet ready, the app renders the Home page instead of an indefinite full-screen loading state.",
        "If the backend is decommissioned (trap message contains \"decommissioned\" or \"Service Unavailable\"), the Decommissioned page still renders reliably.",
        "The app does not poll the URL hash at a high frequency while in a non-interactive loading state (no unnecessary 100ms loop contributing to perceived blank/\"not showing\" behavior)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Remove the full-screen global \"Loading...\" gate as a prerequisite for rendering non-decommissioned routes; render pages immediately (fail-open) while decommission status is still being determined, and keep DecommissionedPage as an override when detected. Remove the 100ms setInterval URL-hash sync loop and rely on hashchange + initial mount sync only."
        },
        {
          "path": "frontend/src/hooks/useSystemStatus.ts",
          "operation": "modify",
          "description": "Adjust system status fetching to be non-blocking for initial UI: treat missing actor during initialization as \"not decommissioned\" without preventing render, and ensure decommission trap detection still sets isDecommissioned true when calls become possible."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure VotingPromoSection widgets always render visible loading, empty, and error states with English user-facing messaging.",
      "acceptanceCriteria": [
        "On the Home page, the VotingPromoSection is visible at the top of the page on first load (regardless of whether a poll exists).",
        "If live poll/voting result queries fail, the user sees a readable inline error message in the widget area (not a blank section).",
        "If there is no active poll, the user sees the existing “No Active Poll” state (or equivalent) instead of empty space."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/site/LivePollWidget.tsx",
          "operation": "modify",
          "description": "Add explicit UI branches for poll status/results query errors (e.g., show an inline Alert within the widget area) so failures never look like empty space; keep all displayed messages in English and avoid misleading \"No Active Poll\" when the real state is a load failure."
        },
        {
          "path": "frontend/src/components/site/VotingPromoSection.tsx",
          "operation": "modify",
          "description": "Ensure the section layout always reserves visible space for the poll/results widget area (no conditional rendering that could collapse the top section), and keep user-facing text in English."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Show a compact on-screen fallback when NotificationPanelErrorBoundary catches errors instead of rendering nothing.",
      "acceptanceCriteria": [
        "If the notification panel subtree throws, the page still loads and a compact fallback message is shown where the notification launcher/panel would appear.",
        "Console logging remains for debugging, but the user also gets an on-screen indication that notifications failed to load.",
        "Normal (non-error) behavior of notification launcher and panel is unchanged."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/notifications/NotificationPanelErrorBoundary.tsx",
          "operation": "modify",
          "description": "Replace the current silent null render on error with a small inline fallback message (English) suitable for both the launcher location and panel location; keep existing console.error logging for debugging."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Verify the notification launcher and panel placements still look correct with the error-boundary fallback present (top-right hero launcher area and the bottom-mounted panel boundary), without changing normal behavior when no error occurs."
        }
      ]
    }
  ]
}