{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-15T06:52:10.393Z",
  "summary": "Backend decommissioning support appears partially started (a `decommissioned` flag and a `checkDecommissioned()` trap), and the frontend adds a Decommissioned page with route override. However, key acceptance criteria are not evidenced: no explicit stable persistence of the flag, no minimal status API (`getSystemStatus`), no admin-only decommission-and-wipe operation, and the frontend detects decommissioning via probing a blocked feature API instead of reading system status.",
  "missing_requirements": [
    {
      "id": "REQ-1",
      "requirement": "Persist a backend-wide decommission flag in stable state, block all regular feature methods consistently when enabled, and expose a minimal status/read-only method (e.g., `getSystemStatus`) to report `isDecommissioned`.",
      "reason": "Diff shows `var decommissioned : Bool = false;` and a `checkDecommissioned()` trap, but does not show stable variable persistence across upgrades nor an explicit `getSystemStatus` (or equivalent) method. The frontend hook also indicates there is no status endpoint and instead probes `getAllPublishedNews()`. Blocking of “all regular feature methods” is not verifiable from the truncated backend file.",
      "evidence": [
        "backend/main.mo",
        "frontend/src/hooks/useSystemStatus.ts"
      ]
    },
    {
      "id": "REQ-2",
      "requirement": "Add a single admin-only backend method (e.g., `decommissionAndWipeAllData`) that turns decommission mode ON and purges all canister state (users/news/schemes/jobs/media metadata/notifications/settings/activity logs/counters), with admin-only protection and optional activity logging.",
      "reason": "No admin-only wipe method is shown in the diff summary. No evidence of clearing all collections and resetting counters/IDs, nor access control checks specific to the wipe operation, nor logging behavior for the operation.",
      "evidence": [
        "backend/main.mo"
      ]
    },
    {
      "id": "REQ-3",
      "requirement": "Frontend must check backend system status on initial load and navigation, and if decommissioned, override all routes with a single decommissioned screen without relying on protected APIs that will be blocked.",
      "reason": "While the Decommissioned page and route override exist, the frontend does not call a backend system-status method. Instead it calls `actor.getAllPublishedNews()` and infers decommissioning from trapped error text, which relies on a protected feature API that should be blocked during decommission mode (contrary to the intent/AC of using a minimal status method).",
      "evidence": [
        "frontend/src/hooks/useSystemStatus.ts",
        "frontend/src/App.tsx",
        "frontend/src/pages/DecommissionedPage.tsx"
      ]
    }
  ],
  "hallucinated_features": [
    {
      "description": "Frontend decommission detection implemented by probing `getAllPublishedNews()` and parsing error messages (\"decommissioned\" / \"Service Unavailable\") instead of using a minimal `getSystemStatus` API.",
      "reason": "BuildRequest explicitly calls for a minimal status/read-only method to detect decommission state; this workaround is not requested and undermines the stated approach.",
      "evidence": [
        "frontend/src/hooks/useSystemStatus.ts"
      ]
    },
    {
      "description": "Added `backend/migration.mo` that initializes a new actor state by emptying `users` and setting `decommissioned = false`.",
      "reason": "BuildRequest only allowed adding a migration file if needed for stable-state migration due to the decommission flag/wipe behavior; the shown migration logic appears to wipe users and does not evidence proper migration of existing state or setting decommission mode for decommissioning.",
      "evidence": [
        "backend/migration.mo"
      ]
    },
    {
      "description": "App adds a 100ms polling interval to resync URL hash routing state.",
      "reason": "Not requested as part of decommissioning behavior; incidental routing/polling logic added beyond the stated requirements.",
      "evidence": [
        "frontend/src/App.tsx"
      ]
    }
  ],
  "confidence": 0.74,
  "changed_files": [
    "backend/main.mo",
    "backend/migration.mo",
    "frontend-file-summaries.txt",
    "frontend/src/App.tsx",
    "frontend/src/hooks/useSystemStatus.ts",
    "frontend/src/pages/DecommissionedPage.tsx",
    "project_state.json"
  ]
}